html.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2022-10-13 Thu 12:03 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=utf-8" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />
  <title>Html</title>
  <meta name="author" content="Kenan Ismail" />
  <meta name="generator" content="Org Mode" />
</head>
<body>
  <div id="content" class="content">
    <h1 class="title">Html</h1>
    <div id="table-of-contents" role="doc-toc">
      <h2>Table of Contents</h2>
      <div id="text-table-of-contents" role="doc-toc">
        <ul>
          <li>
            <a href="#org4156c7a">1. Event listeners</a>
            <ul>
              <li>
                <a href="#org5f67704">1.1. Button example</a>
                <ul>
                  <li><a href="#org43f4754">1.1.1. onclick</a></li>
                </ul>
              </li>
            </ul>
          </li>
          <li><a href="#org034e350">2. How to find elements using
          DOM in js</a></li>
          <li>
            <a href="#org4171d00">3. The DOM node Tree</a>
            <ul>
              <li>
                <a href="#orgfabb1a5">3.1. document.</a>
                <ul>
                  <li><a href="#orgc94b8a5">3.1.1.
                  createElement(’tag’)</a></li>
                  <li><a href="#org6bb3626">3.1.2.
                  createAttribute(’attribute’)</a></li>
                  <li><a href="#orga842942">3.1.3.
                  createTextNode(str)</a></li>
                  <li><a href="#org4625528">3.1.4.
                  .appendChild(nodeVar)</a></li>
                  <li><a href="#org6c8fe0a">3.1.5. Example of
                  all</a></li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
    </div>
    <div id="outline-container-org4156c7a" class="outline-2">
      <h2 id="org4156c7a"><span class="section-number-2">1.</span>
      Event listeners</h2>
      <div class="outline-text-2" id="text-1"></div>
      <div id="outline-container-org5f67704" class="outline-3">
        <h3 id="org5f67704"><span class=
        "section-number-3">1.1.</span> Button example</h3>
        <div class="outline-text-3" id="text-1-1"></div>
        <div id="outline-container-org43f4754" class="outline-4">
          <h4 id="org43f4754"><span class=
          "section-number-4">1.1.1.</span> onclick</h4>
          <div class="outline-text-4" id="text-1-1-1">
            <div class="org-src-container">
              <pre class="src src-html">&lt;<span style=
              "color: #c678dd;">button</span> <span style=
              "color: #dcaeea;">onclick</span>=<span style=
              "color: #98be65;">"alertme"</span>&gt;CLICK&lt;/<span style=
              "color: #c678dd;">button</span>&gt;
</pre>
            </div>
            <div class="org-src-container">
              <pre class="src src-js"><span style=
              "color: #51afef;">function</span> <span style=
              "color: #c678dd;">alertme</span>(){
    alert(<span style="color: #98be65;">"ALERTED"</span>);
        }
</pre>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div id="outline-container-org034e350" class="outline-2">
      <h2 id="org034e350"><span class="section-number-2">2.</span>
      How to find elements using DOM in js</h2>
      <div class="outline-text-2" id="text-2">
        <div class="org-src-container">
          <pre class=
          "src src-js">document.querySelector(<span style=
          "color: #98be65;">'tag'</span>);
</pre>
        </div>
      </div>
    </div>
    <div id="outline-container-org4171d00" class="outline-2">
      <h2 id="org4171d00"><span class="section-number-2">3.</span>
      The DOM node Tree</h2>
      <div class="outline-text-2" id="text-3"></div>
      <div id="outline-container-orgfabb1a5" class="outline-3">
        <h3 id="orgfabb1a5"><span class=
        "section-number-3">3.1.</span> document.</h3>
        <div class="outline-text-3" id="text-3-1"></div>
        <div id="outline-container-orgc94b8a5" class="outline-4">
          <h4 id="orgc94b8a5"><span class=
          "section-number-4">3.1.1.</span>
          createElement(’tag’)</h4>
          <div class="outline-text-4" id="text-3-1-1">
            <p>creates an html tag and can be stored to a
            variable</p>
            <div class="org-src-container">
              <pre class="src src-js"><span style=
              "color: #51afef;">let</span> <span style=
              "color: #dcaeea;">paragraph</span> = document.createElement(<span style="color: #98be65;">'p'</span>);
<span style="color: #5B6268;">//</span><span style=
"color: #5B6268;">This creates a paragraph node and assigns it to the paragraph variable</span>
</pre>
            </div>
          </div>
          <ol class="org-ol">
            <li>
              <a id=
              "org14384ed"></a>.setAttributeNode(attributeNodeVariable)<br />

              <div class="outline-text-5" id="text-3-1-1-1">
                <p>sets the elements attribute to a known attribute
                node (see below)</p>
              </div>
            </li>
          </ol>
        </div>
        <div id="outline-container-org6bb3626" class="outline-4">
          <h4 id="org6bb3626"><span class=
          "section-number-4">3.1.2.</span>
          createAttribute(’attribute’)</h4>
          <div class="outline-text-4" id="text-3-1-2">
            <p>creates an html attribute, this attribute can be
            added to an html tag node later (eg)</p>
          </div>
          <ol class="org-ol">
            <li>
              <a id="org5ee6889"></a>.value<br />
              <div class="outline-text-5" id="text-3-1-2-1">
                <p>accesses the value attribute of the html
                attribute node, can set and get directly.</p>
              </div>
            </li>
          </ol>
        </div>
        <div id="outline-container-orga842942" class="outline-4">
          <h4 id="orga842942"><span class=
          "section-number-4">3.1.3.</span> createTextNode(str)</h4>
          <div class="outline-text-4" id="text-3-1-3">
            <p>creates a text node =)</p>
          </div>
        </div>
        <div id="outline-container-org4625528" class="outline-4">
          <h4 id="org4625528"><span class=
          "section-number-4">3.1.4.</span>
          .appendChild(nodeVar)</h4>
          <div class="outline-text-4" id="text-3-1-4">
            <p>Adds the actual node as a child to another node, if
            added to the document.body node, then it actually
            places it in the webpage</p>
          </div>
        </div>
        <div id="outline-container-org6c8fe0a" class="outline-4">
          <h4 id="org6c8fe0a"><span class=
          "section-number-4">3.1.5.</span> Example of all</h4>
          <div class="outline-text-4" id="text-3-1-5">
            <div class="org-src-container">
              <pre class="src src-js"><span style=
              "color: #51afef;">let</span> <span style=
              "color: #dcaeea;">paragraph</span> = document.createElement(<span style="color: #98be65;">'p'</span>);
<span style="color: #51afef;">let</span> <span style=
"color: #dcaeea;">text</span> = document.createTextNode(<span style="color: #98be65;">"Hehe"</span>);
paragraph.appendChild(text);
<span style="color: #51afef;">let</span> <span style=
"color: #dcaeea;">style</span> = document.createAttribute(<span style="color: #98be65;">'style'</span>);
style.value=<span style="color: #98be65;">"color: red;"</span>;
paragraph.setAttributeNode(style);
document.body.appendChild(paragraph);
</pre>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div id="postamble" class="status">
    <p class="author">Author: Kenan Ismail</p>
    <p class="date">Created: 2022-10-13 Thu 12:03</p>
  </div>
</body>
</html>
